In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

visa_df=pd.read_csv('visadataset.csv')
cat=visa_df.select_dtypes(include='object').columns
num=visa_df.select_dtypes(exclude='object').columns

In [5]:
# create a data
# name
# city
# age 4 values
# each column we will miss one value

dict1={'Names':['Ramesh','Suresh','Mahesh',None],
     'Age':[20,21,None,22],
     'City':[None,'Hyd','Pune','Barampur']}
dict1

{'Names': ['Ramesh', 'Suresh', 'Mahesh', None],
 'Age': [20, 21, None, 22],
 'City': [None, 'Hyd', 'Pune', 'Barampur']}

In [7]:
data=pd.DataFrame(dict1)
data

    Names   Age      City
0  Ramesh  20.0      None
1  Suresh  21.0       Hyd
2  Mahesh   NaN      Pune
3    None  22.0  Barampur

- while creating we provided None

- but by default the dataframe adjust the data type

In [10]:
data.to_csv('data1.csv',index=False)

In [12]:
dict2={'Names':['Ramesh','Suresh','Mahesh',np.nan],
     'Age':[20,21,np.nan,22],
     'City':[np.nan,'Hyd','Pune','Barampur']}
data1=pd.DataFrame(dict2)
data1

    Names   Age      City
0  Ramesh  20.0       NaN
1  Suresh  21.0       Hyd
2  Mahesh   NaN      Pune
3     NaN  22.0  Barampur

In [13]:
data1.to_csv('data2.csv',index=False)

**fillna**

In [14]:
data1.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [15]:
data1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [16]:
data1.fillna(30)

    Names   Age      City
0  Ramesh  20.0        30
1  Suresh  21.0       Hyd
2  Mahesh  30.0      Pune
3      30  22.0  Barampur

In [18]:
data1['Names'].fillna('Manish')

0    Ramesh
1    Suresh
2    Mahesh
3    Manish
Name: Names, dtype: object

- pad

- ffill

- backfill

- bfill

- do not give any value , only provide the method='pad'

In [35]:
import warnings
warnings.filterwarnings('ignore')
pad=data1.fillna(method='pad')
fill=data1.fillna(method='ffill')
bfill=data1.fillna(method='bfill')
backfill=data1.fillna(method='backfill')

In [23]:
data1

    Names   Age      City
0  Ramesh  20.0       NaN
1  Suresh  21.0       Hyd
2  Mahesh   NaN      Pune
3     NaN  22.0  Barampur

In [36]:
pad

    Names   Age      City
0  Ramesh  20.0       NaN
1  Suresh  21.0       Hyd
2  Mahesh  21.0      Pune
3  Mahesh  22.0  Barampur

In [37]:
fill

    Names   Age      City
0  Ramesh  20.0       NaN
1  Suresh  21.0       Hyd
2  Mahesh  21.0      Pune
3  Mahesh  22.0  Barampur

In [39]:
bfill

    Names   Age      City
0  Ramesh  20.0       Hyd
1  Suresh  21.0       Hyd
2  Mahesh  22.0      Pune
3     NaN  22.0  Barampur

In [40]:
backfill

    Names   Age      City
0  Ramesh  20.0       Hyd
1  Suresh  21.0       Hyd
2  Mahesh  22.0      Pune
3     NaN  22.0  Barampur

In [43]:
pad=data1.fillna(method='pad',axis=1)
pad

    Names     Age      City
0  Ramesh    20.0      20.0
1  Suresh    21.0       Hyd
2  Mahesh  Mahesh      Pune
3     NaN    22.0  Barampur

In [44]:
data1.fillna(method='bfill',axis=1)

    Names   Age      City
0  Ramesh  20.0       NaN
1  Suresh  21.0       Hyd
2  Mahesh  Pune      Pune
3    22.0  22.0  Barampur

**mean** **median** **mode**

In [45]:
# first choose the column
# if it is numerical column fill with mean or median
#  if it is categorical column fill with mode
data1

    Names   Age      City
0  Ramesh  20.0       NaN
1  Suresh  21.0       Hyd
2  Mahesh   NaN      Pune
3     NaN  22.0  Barampur

In [47]:
mean_age=data['Age'].mean()
data['Age'].fillna(mean_age)

0    20.0
1    21.0
2    21.0
3    22.0
Name: Age, dtype: float64

In [48]:
median_age=data['Age'].median()
data['Age'].fillna(median_age)

0    20.0
1    21.0
2    21.0
3    22.0
Name: Age, dtype: float64

In [52]:
dict2={'Names':['Ramesh','Suresh','Mahesh',np.nan],
     'Age':[20,21,np.nan,22],
     'City':[np.nan,'Hyd','Pune','Pune']}
data2=pd.DataFrame(dict2)
data2

    Names   Age  City
0  Ramesh  20.0   NaN
1  Suresh  21.0   Hyd
2  Mahesh   NaN  Pune
3     NaN  22.0  Pune

In [54]:
mode_city=data2['City'].mode()
mode_city

0    Pune
Name: City, dtype: object

In [55]:
mean_age

21.0

In [56]:
median_age

21.0

In [58]:
mode_city[0]

'Pune'

In [60]:
mean_age=data['Age'].mean()
data['Age'].fillna(mean_age)

median_age=data['Age'].median()
data['Age'].fillna(median_age)

mode_city=data['City'].mode()
data['City'].fillna(mode_city.values[0])

0    Barampur
1         Hyd
2        Pune
3    Barampur
Name: City, dtype: object

**knn-imputer**

- KNN means K-nearest neighbours

- we will choose the less distance samples

In [62]:
# package_name=sklearn
# classname=imputer
# methodname=KNNImputer

from sklearn.impute import KNNImputer
knn=KNNImputer()
knn.fit_transform(data[['Age']])

array([[20.],
       [21.],
       [21.],
       [22.]])